posts/2019-12-21-win-10-workflow.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-01-03 Fri 09:25 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>My Windows 10 Workflow</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Eric Nguyen">
<link rel="icon" href="favicon.ico"><link rel="stylesheet" type="text/css" href="assets/css/main.css">
</head>
<body>
<div id="preamble" class="status">
<nav><p>Navigation: <a href="index.html">Home</a> <a href="archive.html">Blog</a> <a href="about.html">About</a> <a href="contact.html">Contact</a> </nav>
</div>
<div id="content">
<header>
<h1 class="title">My Windows 10 Workflow</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org70623d5">1. Introduction</a></li>
<li><a href="#org3ebfd95">2. Essential configurations</a></li>
<li><a href="#orgafe3675">3. Essential software</a></li>
<li><a href="#org1ed030d">4. Keybindings to know</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org70623d5" class="outline-2">
<h2 id="org70623d5"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
So, I&rsquo;ve been fed up with Windows 10 and it&rsquo;s annoying that Spacemacs won&rsquo;t work with org-babel-execute.
I mean, it works fine in vanilla Emacs; but I&rsquo;m honestly just finding an excuse to switch to a different OS just because I can&rsquo;t stand using the same OS.
It gets boring.
</p>

<p>
I&rsquo;m writing this post for whenever I need to use Windows 10 so I don&rsquo;t have to memorize which settings I need to turn on or off, which programs to install, etc.
</p>
</div>
</div>

<div id="outline-container-org3ebfd95" class="outline-2">
<h2 id="org3ebfd95"><span class="section-number-2">2</span> Essential configurations</h2>
<div class="outline-text-2" id="text-2">
<p>
Here are the essential configurations for my Windows 10 workflow.
</p>

<ol class="org-ol">
<li>Adjust the appearance and performance of Windows
<ul class="org-ul">
<li>In Performance Options &gt; Visual Effects, uncheck all of the boxes except for &ldquo;Show thumbnails instead of icons&rdquo;.</li>
</ul></li>

<li>Right click the taskbar and go to Taskbar settings
<ul class="org-ul">
<li>Taskbar location on screen: Top</li>
<li>Combine taskbar buttons: Never</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgafe3675" class="outline-2">
<h2 id="orgafe3675"><span class="section-number-2">3</span> Essential software</h2>
<div class="outline-text-2" id="text-3">
<p>
Try to keep the amount of software installed at a minimum.
These are essential software that should be installed.
</p>

<ul class="org-ul">
<li>Emacs</li>
<li>Keybase</li>
<li>MikTeX</li>
<li>Window Terminal (Preview)</li>
</ul>
</div>
</div>

<div id="outline-container-org1ed030d" class="outline-2">
<h2 id="org1ed030d"><span class="section-number-2">4</span> Keybindings to know</h2>
<div class="outline-text-2" id="text-4">
<p>
Keybindings are the most important thing for feeling and looking like a 1337 hacker.
These are the ones that I find myself using most often.
Note that <code>W</code> corresponds to the Windows key, <code>S</code> to the Shift key, and <code>C</code> to the Ctrl key.
</p>

<ul class="org-ul">
<li><code>W-e</code> &rarr; Open File Explorer</li>
<li><code>W-S-d</code> &rarr; Create a new workspace</li>
<li><code>C-W-f4</code> &rarr; Delete the current workspace</li>
<li><code>W-[0-9]</code> &rarr; Jump to specified application in current workspace</li>
<li><code>W-l</code> &rarr; Go to lock screen</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-12-21</p>
<p class="author">Author: Eric Nguyen</p>
<p class="email">Email: <a href="mailto:tuk94307@temple.edu">tuk94307@temple.edu</a></p>
<p class="date">Created: 2020-01-03 Fri 09:25</p>
</div>
</body>
</html>
